"use strict";

console.log(
    "JavaScript Core #10. Домашнє завдання. Основи JavaScript: Функції",
);

/**
 * Завдання
 * 1. Створити калькулятор у вигляді функції calc яка приймає три параметри:
 *
 * операнд 1
 * операнд 2
 * математичну операцію у вигляді символа
 * 2. Операції які мають підтримуватися:
 *
 * додавання
 * віднімання
 * множення
 * ділення
 * 3. Викликати функцію з різними параметрами і вивести всі результати на екран
 *
 * 4. Функція має перевіряти що операнд_1 і операнд_2 є числами
 *
 * 5. Якщо любий з операндів не є числом - виводити помилку у консоль
 *
 * Приклад використання калькулятора:
 *
 *       calc(2, 12, "*");		 // результат: 24
 *       calc(6, -2, "+"); 		// результат: 4
 *       calc(5, 17, "-"); 		// результат: -12
 *       calc(100, 4, "/"); 		// результат: 25
 */
