"use strict";

console.log(
    "JavaScript Core #7. Домашнє завдання. Основи JavaScript: Масиви (Arrays)",
);

/**
 * Створити масив чисел розміром 10 елементів.
 * Записати випадкове(random) число в кожну ячейку масиву
 * Вивести масив на екран
 * складне:
 *
 * пройти по масиву і перемножити кожне 2-ге число на 2
 * Приклад:
 *
 * до:        [3,  7,  8, 3, 4,  6, 0, 2, 12,  4]
 *
 * після:    [3, 14, 8, 6, 4, 12 ,0, 4, 12, 8]
 *
 * Важливо: алгоритм має працювати для масиву любого розміру
 */

const arr = new Array(10);

for (let i = 0; i < arr.length; i++) {
    arr[i] = Math.floor(Math.random() * 21);
}

console.log(arr);

for (let i = 1; i < arr.length; i += 2) {
    arr[i] *= 2;
}

console.log(arr);
