"use strict";

console.log(
  "JavaScriptStart #2. Домашнє завдання. Основи JavaScript: Оператори та Вирази",
);

/*
 * Перевірка категорії віку
 *
 * Створіть змінну age, що містить вік людини, а саме 45.Використайте конструкцію if-else для перевірки:
 *
 * Якщо вік менше 13 років, виведіть "Дитина".
 * Якщо вік від 13 до 19, виведіть "Підліток".
 * Якщо вік від 20 до 59, виведіть "Дорослий".
 * Якщо вік 60 років або більше, виведіть "Пенсіонер".
 */

function checkAgeCategory(age) {
  // Використайте if-else для перевірки категорії віку
}
