"use strict";

console.log(
    "JavaScript Core #6. Домашнє завдання. Основи JavaScript: Цикли for та while",
);

/**
 * Згенерувати число X від 1 до 100.
 * Створити бомбу зі зворотнім відліком від 100 до 0
 * Розмінування має статися в рандомний момент згідно числа X.
 * Якщо X меньше 10 - в консоль виводиться “BOOM!” (сапери не встигли розмінувати бомбу)
 * Якщо X більше 10 - в консоль виводиться “Розміновано.”
 * Приклад:
 *
 * X = 15
 *
 * Лічильник зворотного відліку рахує від 100, 99, 98, 97….
 *
 * На числі 15 в консоль виводиться “Розміновано.”
 */
