"use strict";

console.log(
  "JavaScriptStart #2. Домашнє завдання. Основи JavaScript: Оператори та Вирази",
);

/*
 * Використання логічних операторів
 *
 * Створіть змінні a, b, і c, яким присвойте значення 5, 10, і 15 відповідно. Використайте логічні оператори && (логічне І) та || (логічне АБО) для перевірки таких умов:
 * Створіть змінну isLess результатом якої буде результат чи є змінна a меншою за b та b меншою за c?
 * Створіть змінну isEqual результатом якої буде результат який дорівнює хоча б одна зі змінних значенню 10?
 * Виведіть результати перевірок у консоль.
 */

console.log(
  "******************************\n" +
    "Task 1\n" +
    "******************************",
);
